const ukr = {
  intro_title: "Загальні дані",
  periods: "Періоди",
  period: "Період",
  add_period: "Додати період",
  excel: "MS EXCEL",
  data_analysis: "Аналіз даних",
  new_period_name: "Новий період",
  id: "ID",
  gender: "Стать",
  woman: "Жінка",
  man: "Чоловік",
  birth_date: "Дата народження",
  fill_date: "Дата опитування",
  from: "З",
  till: "До",
  period_length: "Тривалість періоду",
  period_years: "роки",
  period_months: "місяці",
  period_days: "дні",
  weight: "Вага (кг)",
  height: "Зріст (см)",
  livingPlace: "Місце проживання",
  Riga: "Рига",
  town: "Місто",
  rural: "Сільська місцевість",
  period_filled: "Заповнено",
  needed: "потрібно всього",
  changePeriodName: "Змінити назву періоду",
  deletePeriod: "Видалити період",
  workdays: "Робочі дні",
  weekends: "Вихідні",
  vacations: "Відпустка",
  days_per_week: "Днів на тиждень",
  days_per_week_lowercase: "днів на тиждень",
  days_per_month: "Днів на місяць",
  days_per_year: "Днів на рік",
  weeks_per_year: "Тижнів на рік",
  hours_per_day: "Годин на день",
  hours_per_week: "Годин на тиждень",
  hours_per_month: "Годин на місяць",
  minutes_per_day: "Хвилин на день",
  volume: "Об'єм",
  work: "Праця",
  sleep: "Сон",
  walk: "Рух",
  sport: "Спорт",
  self: "Самообслуговування",
  home: "Побутові справи",
  free: "Вільний час",
  select_period: "Виберіть період для відновлення",
  ok: "OK",
  restore_period: "Відновити видалений період",
  name: "Назва",
  type: "Тип дня",
  addDayType: "Додати тип дня",
  changeDayTypeName: "Редагувати назву типу дня",
  deleteDayType: "Видалити тип дня",
  weeks_in_year_from: "тижнів на рік (з 52,18)",
  shortage: "недостача",
  excess: "перевищення",
  confirm_periodDelete: "Ви хочете видалити цей період?",
  confirm_dayTypeDelete: "Ви хочете видалити цей тип дня?",
  sub_free_000: "Шиття, ремонт та обслуговування текстилю",
  sub_free_001: "Будівництво та ремонт меблів",
  sub_free_002: "Газон, сад і домашні рослини",
  sub_free_003: "Ремонт та обслуговування автомобіля (самостійно)",
  sub_free_004: "Догляд і допомога дітям вдома",
  sub_free_005: "Освіта",
  sub_free_006: "Покупки споживачів",
  sub_free_007: "Використання медичних послуг",
  sub_free_008: "Використання послуг з обслуговування, ремонту, декорування та будівництва вдома",
  sub_free_009: "Громадянські обов'язки та участь",
  sub_free_010: "Спілкування та обмін інформацією з іншими",
  sub_free_011: "Відпочинок, роздуми",
  sub_free_012: "Вживання тютюну та наркотиків",
  sub_free_013: "Телебачення і кіно (не релігійне)",
  sub_free_014: "Прослуховування радіо",
  sub_free_015: "Слухання / гра в музику (не радіо)",
  sub_free_016: "Гра в ігри",
  sub_free_017: "Використання комп'ютера для відпочинку (крім ігор)",
  sub_free_018: "Мистецтво і ремесла як хобі",
  sub_free_019: "Колекціонування як хобі",
  sub_free_020: "Хобі, за винятком мистецтва і ремесел та колекціонування",
  sub_free_021: "Читання для особистого інтересу",
  sub_free_022: "Письмо для особистого інтересу",
  sub_free_023: "Відпочинок та дозвілля, інше, 1",
  sub_free_024: "Відвідування виставкових заходів",
  sub_free_025: "Відвідування музеїв",
  sub_free_026: "Відвідування кіно / фільмів",
  sub_free_027: "Відвідування азартних закладів",
  sub_free_028: "Спілкування, відпочинок та дозвілля, інше",
  sub_free_029: "Танці",
  sub_free_030: "Риболовля",
  sub_free_031: "Похід",
  sub_free_032: "Мисливство",
  sub_free_033: "Роликовий спорт",
  sub_free_034: "Відвідування спортивних заходів, інше",
  sub_free_035: "Відвідування релігійних служб",
  sub_free_036: "Релігійні та духовні заходи, інше",
  sub_free_037: "Волонтерська діяльність",
  sub_free_038: "Прогулянки, прогулянки по дому",
  sub_free_039: "Прогулянка, 3,2 км / год, рівний, повільний темп, тверда поверхня",
  sub_free_040: "Відпочинок та дозвілля, інше, 2",
  sub_free_041: "Відпочинок та дозвілля, інше, 3",
  sub_sleep_000: "Сон",
  sub_work_000:"Управління (директори, менеджери, наглядачі)",
  sub_work_001:"Бізнес та фінанси (бухгалтери, бізнес-аналітики, фінансові спеціалісти)",
  sub_work_002:"Комп'ютерні науки та математика (програмісти, веб-дизайнери, аналітики програмного забезпечення)",
  sub_work_003:"Архітектура та інженерія (архітектори, інженери)",
  sub_work_004:"Науки про життя, фізика і соціологія (історики, геологи, психологи, антропологи)",
  sub_work_005:"Соціальні служби та соціальний захист (соціальні працівники, працівники з громадського здоров'я)",
  sub_work_006:"Право і судова практика (юристи, судді)",
  sub_work_007:"Освіта, навчання та бібліотечна справа (педагоги, бібліотекарі)",
  sub_work_008:"Мистецтво, дизайн, розваги, спорт та медіа (дизайнери інтер'єрів, флористи, модельєри, актори, музиканти, продюсери, тренери, фотографи, фахівці з громадських відносин)",
  sub_work_009:"Медичний персонал та технічний персонал (лікарі, стоматологи, логопеди, хірурги)",
  sub_work_010:"Медична допомога",
  sub_work_011:"Захист населення та безпека (пожежники, поліцейські)",
  sub_work_012:"Приготування їжі та обслуговування (шеф-кухарі, бармени, офіціанти)",
  sub_work_013:"Прибирання та обслуговування приміщень і територій (комірники та працівники з обслуговування будівель, робітники з контролю за шкідниками)",
  sub_work_014:"Особистий догляд та обслуговування (перукарі, косметологи)",
  sub_work_015:"Торгівля та пов'язані професії (касири, моделі, страхові агенти)",
  sub_work_016:"Офісна робота та адміністративна підтримка (секретарі, представники з обслуговування клієнтів)",
  sub_work_017:"Сільське господарство, лісівництво та рибальство (працівники з охорони лісів та природи, рибалки, сільськогосподарські робітники)",
  sub_work_018:"Будівництво та видобуток (теслярі, будівельні інспектори, робітники з утеплення, встановлювачі стелі, стіни, підлоги)",
  sub_work_019:"Встановлення, обслуговування та ремонт (техніки та механіки автосервісу, електрики та електроніки, загальні робітники з обслуговування та ремонту)",
  sub_work_020:"Виробництво (робітники з переробки харчових продуктів, робітники металевих та пластикових виробів)",
  sub_work_021:"Транспорт та перевезення матеріалів (водії автобусів, кондуктори, водії таксі)",
  sub_self_000: "Миття, одягання та догляд за собою",
  sub_self_001: "Їжа та пиття",
  sub_walk_000: "Прогулянка на роботі, 4,8 км / год, в офісі, помірна швидкість, без несення чого-небудь",
  sub_walk_001: "Прогулянка від дому, до автомобіля або автобуса, від автомобіля або автобуса, від автомобіля або автобуса до робочого місця і назад",
  sub_walk_002: "Водіння легкового автомобіля або легкового вантажівки (не напівфургона)",
  sub_walk_003: "Поїздка автомобілем або вантажівкою",
  sub_walk_004: "Велосипедизм, <16 км / год, дозвілля, на роботу або задоволення",
  sub_home_000: "Прибирання в середині",
  sub_home_001: "Домашні справи, інше, 1",
  sub_home_002: "Приготування їжі та напоїв",
  sub_home_003: "Прибирання кухні та посуду",
  sub_home_004: "Обслуговування і ремонт внутрішнього приміщення, інше",
  sub_home_005: "Обслуговування, ремонт та декорування зовнішнього приміщення",
  sub_home_006: "Догляд за тваринами та тваринами, інше",
  sub_home_007: "Фізичний догляд за дітьми вдома",
  sub_home_008: "Фізичний догляд за дорослими вдома",
  sub_home_009: "Догляд за та допомога нечленам сім'ї, інше",
  sub_home_010: "Використання ветеринарних послуг",
  sub_home_011: "Домашні справи, інше, 2",
  sub_home_012: "Домашні справи, інше, 3",
  sub_sport_000: "Займання аеробікою",
  sub_sport_001: "Гра в бейсбол",
  sub_sport_002: "Гра в баскетбол",
  sub_sport_003: "Катання на велосипеді",
  sub_sport_004: "Гра в більярд",
  sub_sport_005: "Плавання на човні",
  sub_sport_006: "Боулінг",
  sub_sport_007: "Сходження на гору, підземне дослідження, спелеологія",
  sub_sport_008: "Участь у конно-спортивних заходах",
  sub_sport_009: "Фехтування",
  sub_sport_010: "Гра в футбол",
  sub_sport_011: "Гольф",
  sub_sport_012: "Займання гімнастикою",
  sub_sport_013: "Гра в хокей",
  sub_sport_014: "Участь в бойових мистецтвах",
  sub_sport_015: "Гра в ракетні види спорту",
  sub_sport_016: "Участь у родео-змаганнях",
  sub_sport_017: "Гра в регбі",
  sub_sport_018: "Біг",
  sub_sport_019: "Катання на лижах, ковзання, сноубординг",
  sub_sport_020: "Гра в футбол",
  sub_sport_021: "Софтбол",
  sub_sport_022: "Автомобільний турізм / автогонки",
  sub_sport_023: "Гра в волейбол",
  sub_sport_024: "Прогулянка",
  sub_sport_025: "Водні види спорту",
  sub_sport_026: "Важка атлетика / тренування силових вправ",
  sub_sport_027: "Фітнес, невизначений",
  sub_sport_028: "Боротьба",
  sub_sport_029: "Займання йогою",
  sub_sport_030: "Гра в спорт, н.в.д.і.к., 1",
  sub_sport_031: "Спорт, фізична активність і відпочинок, н.в.д.і.к., 1",
  sub_sport_032: "Спорт, фізична активність і відпочинок, н.в.д.і.к., 2",
  sub_sport_033: "Спорт, фізична активність і відпочинок, н.в.д.і.к., 3",
  sub_sport_034: "Гра в спорт, н.в.д.і.к., 2",
  sub_sport_035: "Гра в спорт, н.в.д.і.к., 3",
  sub_all_0: "1: Низька активність",
  sub_all_1: "2: Середньо-низька активність",
  sub_all_2: "3: Середня активність",
  sub_all_3: "4: Середньо-висока активність",
  sub_all_4: "5: Висока активність",
  comment: "Коментар",
  from_these_filled: ", з цих заповнених",
  total_in_period: "Всього за період",
  hours_per_day_lowercase: "годин в день",
  subcategory: "Підкатегорія",
  hint: "Підказка",
  loadExcel: "Завантажити з MS Excel",
  generateExcel: "Зберегти як MS Excel",
  generateReview: "Створити звіт",
  weight_plain: "Вага",
  height_plain: "Зріст",
  duration: "Тривалість",
  days_per_week_short: "д/тиждень",
  days_per_month_short: "д/місяць",
  days_per_year_short: "д/рік",
  weeks_per_year_short: "тиждні/рік",
  hours_per_day_short: "г/д",
  hours_per_week_short: "г/тиждень",
  hours_per_month_short: "г/місяць",
  minutes_per_day_short: "хв/д",
  activity: "Активність",
  subActivity: "Підактивність",
  calories: "Калорії",
  total: "Всього",
  days_uppercase: "Дні",
  day_type_nr: "Номер типу дня",
  harris_benedict: "Виправлене рівняння Гарріса-Бенедикта (1984)",
  mifflin: "Рівняння Міффліна Сент-Джора (1990)",
  analyze: "Аналіз",
  cals_per_week: "Калорій на тиждень",
  mets_per_week: "METs на тиждень",
  recalculate: "Перерахувати",
  append_interval: "Додати інтервал",
  statistics: "Статистика",
  deleteInterval: "Видалити інтервал",
  deleteSubcategory: "Видалити підкатегорію",
  default: "(за замовчуванням)",
  duplicateSubcategory: "Дублювати підкатегорію наступного типу дня",
  about: "Про програму",
  selfEval: "Самооцінка фізичної активності"
};

const aboutText_ukr=`
<h1>Програма "Калькулятор активностей на все життя"</h1>
<h2>Версія v4.3</h2>
<ol>
<li>Виправлено помилку у розрахунку МЕТ для піддіяльностей з одиницею "Годин на місяць".</li>
</ol>
<h2>Версія v4.2</h2>
<ol>
<li>Виправлено помилку у розрахунку годин на день при виборі одиниць "Годин на тиждень" та "Годин на місяць".</li>
</ol>
<h2>Версія v4.1</h2>
<ol>
<li>Якщо під час читання даних з Excel зустрічається підкатегорія, якої немає в цій версії інструменту, її назва для наочності береться у квадратні дужки.</li>
</ol>
<h2>Версія v4</h2>
<ol>
<li>Чотири підкатегорії були потрійні:</li>
  <ol style="list-style-type: lower-alpha; padding-bottom: 0;">
    <li>Розслаблення і дозвілля, н.е.д.</li>
    <li>Домашня робота, н.е.д.</li>
    <li>Спорт, вправи і розваги, н.е.д.</li>
    <li>Грати у спорт, н.е.д.</li>
  </ol>
<li>Була створена спрощена версія розгортання інструмента - тепер вона доступна в тестовому режимі за адресою https://theoreman.github.io/CalcReloaded</li>
</ol>
<h2>Версія v3.1</h2>
<ol>
<li>Для всіх підкатегорій зайнятості приклади конкретних професій вказані в дужках.</li>
<li>Скорочення "інше" видалено з назви певних підкатегорій вільного часу та домогосподарства.</li>
<li>Зроблено так, що під час прокручування екрана кнопка "Про програму" завжди знаходиться в нижньому правому куті.</li>
</ol>
<h2>Версія v3.0</h2>
<ol>
  <li>Додана кнопка "Про програму", де можна переглянути всі історичні зміни версій.</li>
  <li>Введено нові підкатегорії для всіх категорій.</li>
  <li>Додана підтримка української мови.</li>
  <li>Виправлено помилку при імпорті з MS Excel: одиниці надкатегорій не змінювалися на "Години на день".</li>
  <li>Виправлено помилку при видаленні підкатегорій: при видаленні останньої підкатегорії поля введення батьківської категорії не відновлювалися.</li>
</ol>
<h2>Версія v2.0</h2>
<ol>
  <li>Покращено вигляд кнопок та полів введення.</li>
  <li>Встановлено Mifflin St Jeor equation за замовчуванням, і слово "за замовчуванням" додано в дужках.</li>
  <li>Додано опцію копіювання підкатегорій для наступного типу дня за допомогою натискання іконки зеленої стрілки. У цьому випадку підкатегорія в наступному типі дня виділяється червоним, щоб легко помітити, що вона була автоматично додана і може вимагати уваги для виправлення.</li>
  <li>Додана перевірка, щоб забезпечити, що до однієї категорії не додаються кілька підкатегорій з однаковою назвою (вручну чи шляхом копіювання [див. пункт 3]).</li>
  <li>Додано нове поле введення "Самооцінка фізичної активності" для кожного періоду, яке також експортується в Excel і імпортується назад в інструмент.</li>
</ol>
<h2>Версія v1.0</h2>
<ol>
  <li>Новий дизайн з усім в одному місці.</li>
  <li>Підтримка кількох мов.</li>
  <li>Переструктурування структури категорій та підкатегорій - тепер кожен тип дня може мати свій набір категорій, і кожна категорія може мати свій власний набір підкатегорій.</li>
  <li>Можливість видалення періодів і відновлення видалених періодів.</li>
  <li>Можливість додавання та видалення типів днів (робочих і відпусток).</li>
  <li>Можливість видалення підкатегорій.</li>
  <li>Перероблено розділ аналізу даних для полегшення (автоматичного) перерахунку, виконання різних дій - відкриття цього розділу, натискання кнопки "Перерахувати", зміни рівняння або типу значення тощо.</li>
  <li>У розділі аналізу даних додано можливість створювати довільні інтервали, які зберігаються навіть під час перерахунку даних. Також додано опцію видалення створених інтервалів.</li>
  <li>Інтервали аналізу даних, створені при експорті в Excel, експортуються разом з усіма даними періоду.</li>
  <li>Імпорт Excel працює лише для файлів, експортованих цією новою версією CalcReloaded v1.0. Можливо, пізніше ми зробимо (якщо буде потрібно) імпорт для старих файлів.</li>
  <li>Важливо - при імпорті файлу Excel (кнопка "Завантажити з MS Excel") калькулятор повинен бути встановлений на ту ж саму мову, що й мова, використана для експорту імпортованого файлу (після імпорту, звісно, мову можна вільно змінювати знову).</li>
</ol>
<br>
`;
